package org.example.ui;

public class ConsoleUI {

    private void menu(){

        System.out.println("Введіть вашу роль: " +
                "1. Користувач" +
                "2. Працівник");

        System.out.println("Введіть код доступу: ");

        System.out.println("Код доступу не вірний. Спробуйте ще раз: ");

        System.out.println("Оберіть що вам потрібно: " +
                "1. Знайти тваринку" +
                "2. Зареєструвати тваринку" +
                "3. Подати заявку на прихисток");

        System.out.println("Оберіть що вам потрібно: " +
                "1. Змінити статус тваринки");

        System.out.println("Оберіть вид тваринки,яку ви хочете прихистити: " +
                "1. Котик" +
                "2. Песик");

        System.out.println("Знайдені тварини: ");

        System.out.println("На даний момент тварини відсутні.");

        System.out.println("Введіть вид тварини, яку хочете зареєструвати: " +
                "1. Котик" +
                "2. Песик");

        System.out.println("Введіть вік тварини, яку хочете зареєструвати: ");

        System.out.println("Введіть ім'я тварини, яку хочете зареєструвати: ");

        System.out.println("Тваринка успішно зареєстрована. чекайте поки з вами зв'яжуться.");

        System.out.println("Введіть ваше ім'я: ");

        System.out.println("Введіть ваш вік: ");

        System.out.println("Ви не можете прихистити тваринку.");

        System.out.println("Ваша заявка прийнята. Очікуйте поки звами зв'яжуться.");

        System.out.println("Оберіть тварину, статус якої бажаєте змінити: " +
                "1. Котик" +
                "2 Песик");

        System.out.println("Статус успішно оновлено.");

    }


}
